In [4]:
import pandas as pd 
import numpy as np

In [6]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [14]:
df.to_csv('output.csv', index=True)

In [15]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [16]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [21]:
mask = df['Age'] > 30

In [22]:
df[mask]

      Name  Age     City
2  Charlie   35  Chicago

In [23]:
df['Salary'] = [50000, 60000, 70000]

In [24]:
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [26]:
mask = ( df['Age'] > 30 )  &  ( df['Salary'] > 60000 )

In [27]:
mask

0    False
1    False
2     True
dtype: bool

In [28]:
df[mask]

      Name  Age     City  Salary
2  Charlie   35  Chicago   70000